app/views/users/show.html.erb

<p><%= "#{@user.first_name} #{@user.second_name}" %></p>
<h2><% @user.tweets.each do |tweet| %></h2>
---
SELECT "tweets".* FROM "tweets" WHERE "tweets"."user_id" = ?  [["user_id", 1]]