app/controllers/tweets_controller.rb

INSERT INTO "tweets" ("user_id", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 5], ["content", "qfw"], ["created_at", "2018-05-23 17:02:05.576966"], ["updated_at", "2018-05-23 17:02:05.576966"]]
---
def create
 @tweet = Tweet.new(@tweet_params)
 if tweet.save