app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "second_name" = ?, "encrypted_password" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["second_name", "testnew"], ["encrypted_password", "$2a$10$1R1A0n2Evmz/vrHXFPXla.DTLGBf11LvhTVBFtKHGRsC.unHYYTga"], ["updated_at", "2018-05-23 15:59:28.787474"], ["id", 5]]
---
  def update
    @user = User.find(params[:id])
    if
    @user.update_attributes(user_update_params)